app/controllers/only_controller.rb

  def get_details
    if params[:style] == "" then
      @boot = Boot.new
      @boot.name = '---'
      @boot.sku = '---'
    else
      @boot = Boot.find(params[:style])
---
SELECT * FROM `boots` WHERE (`boots`.`id` = 7141832)

  def get_colors
    @colors = Boot.find(params[:style]).colors.collect do |co|
---
SELECT * FROM `boots` WHERE (`boots`.`id` = 7141832)
SELECT * FROM `colors` WHERE (`colors`.boot_id = 7141832)

  def get_term
    @explanation = Term.find_by_term_string(params[:term]).explanation
---
SELECT * FROM `terms` WHERE (`terms`.`term_string` = 'Vibram') LIMIT 1